<?php

return [
    // GENERAL
    'general' => [
        'to_date_more_than_from_date' => 'يجب ان يكون تاريخ {من} اقل من تاريخ {الي}.',
    ],

    // SEASONS
    'seasons_validation' => [
        'name' => [
            'required'  => 'يجب ادخال اسم الموسم.',
            'unique'    => 'اسم الموسم موجود بالفعل.',
            'max'       => 'يجب أن يكون اسم الموسم أقل حروفا.',
            'min'       => 'يجب أن يكون اسم الموسم أكثر حروفا.',
        ],
        'starting_date' => [
            'required'  => 'يجب ادخال تاريخ بداية الموسم.',
            'date'      => 'لم يتم اختيار تاريخ بداية الموسم.',
        ],
        'ending_date' => [
            'required'  => 'يجب ادخال تاريخ انتهاء الموسم.',
            'date'      => 'لم يتم اختيار تاريخ انتهاء الموسم.',
        ]
    ],

    // SUPPLIERS
    'suppliers_validation' => [
        'name' => [
            'required'  => 'يجب ادخال اسم المورد.',
            'unique'    => 'اسم المورد موجود بالفعل.',
            'min'       => 'اسم المورد يجب ان يكون حروف اكثر.',
            'max'       => 'اسم المورد يجب ان يكون حروف اقل.',
        ],
        'description' => [
            'min'       => 'وصف و معلومات المورد يجب ان تكون اكثر في الحروف.',
            'max'       => 'وصف و معلومات المورد يجب ان تكون اقل في الحروف.',
        ],
        'address_contact' => ['required' => 'يجب اختيار العناوين و الارقام.'],
        'address_contact_inputs' => [
            // ADDRESS
            'address' => [
                'required' => 'يجب ادخال العنوان لفرع المورد.',
                'min'       => 'عنوان المورد يجب ان يكون حروف اكثر.',
                'max'       => 'عنوان المورد يجب ان يكون حروف اقل.',
            ],
            // CONTACTS
            'contacts' => [
                'name' => [
                    'required'  => 'يجب ادخال اسم العامل في الفرع.',
                    'min'       => 'اسم العامل في الفرع يجب ان يكون حروف اكثر.',
                    'max'       => 'اسم العامل في الفرع يجب ان يكون حروف اقل.',
                ],
                'phone_number' => [
                    'required' => 'يجب ادخال رقم العامل في الفرع.',
                    'min'       => 'رقم العامل في الفرع يجب ان يكون ارقام اكثر.',
                    'max'       => 'رقم العامل في الفرع يجب ان يكون ارقام اقل.',
                ],
                'position_id' => [
                    'required' => 'يجب اختيار الوظيفة.',
                    'exists' => 'اختيار الوظيفة غير صحيح.',
                ],
            ],
        ],
        // PAYMENTS
        'payments' => [
            'date' => [
                'required' => 'يجب اختيار التاريخ.',
                'date' => 'التاريخ غير صحيح.',
            ],
            'supplier' => [
                'required' => 'يجب اختيار المورد.',
                'exists' => 'المورد غير صحيح.',
            ],
            'supplier_address_id' => [
                'required' => 'يجب اختيار فرع المورد.',
                'exists' => 'فرع المورد غير صحيح.',
            ],
            'supplier_contact_id' => [
                'required' => 'يجب اختيار اسم الشخص.',
                'exists' => 'اسم الشخص غير صحيح.',
            ],
            'amount' => [
                'required' => 'يجب ادخال القيمة.',
                'numeric'  => 'يجب ادخال رقم.',
                'max'      => 'الرقم المدفوع غير صحيص!',
                'min'      => 'الرقم المدفوع غير صحيص!',
            ],
            'payment_types' => [
                'required' => 'يجب اختيار طريقة الدفع.',
                'exists' => 'طريقة الدفع غير صحيح.',
            ],
        ]
    ],

    // WAREHOUSES
    'warehouses_validation' => [
        'name' => [
            'required'  => 'يجب ادخال اسم المخزن.',
            'unique'    => 'اسم المخزن موجود بالفعل.',
            'max'       => 'يجب أن يكون اسم المخزن أقل حروفا.',
            'min'       => 'يجب أن يكون اسم المخزن أكثر حروفا.',
        ],

        'description' => [
            'max'       => 'يجب أن يكون المعلومات الاضافية عن المخزن أقل حروفا.',
            'min'       => 'يجب أن يكون المعلومات الاضافية عن المخزن أكثر حروفا.',
        ],

        'location' => [
            'required'  => 'يجب ادخال موقع المخزن.',
            'max'       => 'يجب أن يكون موقع المخزن أقل حروفا.',
            'min'       => 'يجب أن يكون موقع المخزن أكثر حروفا.',
        ],
    ],

    // CATEGORIES
    'categories_validation' => [
        'name' => [
            'required'  => 'يجب ادخال اسم الفئة.',
            'unique'    => 'اسم الفئة موجود بالفعل.',
            'max'       => 'يجب أن يكون اسم الفئة أقل حروفا.',
            'min'       => 'يجب أن يكون اسم الفئة أكثر حروفا.',
        ],

        'description' => [
            'max'       => 'يجب أن يكون المعلومات الاضافية عن الفئة أقل حروفا.',
            'min'       => 'يجب أن يكون المعلومات الاضافية عن الفئة أكثر حروفا.',
        ],

        'subcategories' => [
            'name'      => [
                'required'  => 'يجب ادخال اسم الفئة الفرعية.',
                'max'       => 'يجب أن يكون اسم الفئة الفرعية أقل حروفا.',
                'min'       => 'يجب أن يكون اسم الفئة الفرعية أكثر حروفا.',
            ],
            'description' => [
                'max'       => 'يجب أن يكون المعلومات الاضافية عن الفئة الفرعية أقل حروفا.',
                'min'       => 'يجب أن يكون المعلومات الاضافية عن الفئة الفرعية أكثر حروفا.',
            ],
            'category' => 'الفئة غير صحيحة.',
        ],
    ],

    // PRODUCTS
    'products_validation' => [
        'code' => [
            'required'  => 'يجب ادخال كود الصنف.',
            'unique'    => 'كود الصنف موجود بالفعل في منتج آخر.',
        ],

        'name' => [
            'required'  => 'يجب ادخال اسم الصنف.',
            'unique'    => 'اسم الصنف موجود بالفعل في منتج آخر.',
            'max'       => 'يجب أن يكون اسم الصنف أقل حروفا.',
            'min'       => 'يجب أن يكون اسم الصنف أكثر حروفا.',
        ],

        'barcode' => [
            'size'      => 'حجم الباركود يجب ان يكون 13 رقم.',
            'unique'    => 'الباركود موجود بالفعل.',
        ],

        'category_id' => [
            'required'  => 'يجب اختيار الفئة.',
            'exists'    => 'اختيار غير موجود!',
        ],

        'subcategories_id' => [
            'required'  => 'يجب اختيار الفئات الفرعية.',
            'exists'    => 'اختيار غير موجود!',
        ],

        'seasons_id' => [
            'required'  => 'يجب اختيار المواسم.',
            'exists'    => 'اختيار غير موجود!',
        ],

        'image' => [
            'required'  => 'يجب اختيار الصوره للمنتج.',
            'mimes'     => 'يجب اختيار صور فقط.',
            'max'       => 'حجم الصورة كبير جدا! يمكنك تصغير حجم الصورة و رفعها مرة اخرا.',
            'max_number'=> 'هذا المنتج لدية عدد كبير من الصور. يجب حزف صورة لاضافة صورة اخرا.',
        ],
        'description' => [
            'max'       => 'يجب أن يكون المعلومات الاضافية عن المنتج أقل حروفا.',
            'min'       => 'يجب أن يكون المعلومات الاضافية عن المنتج أكثر حروفا.',
        ],
        'product_id' => [
            'required'  => 'يجب اختيار منتج.',
            'exists'    => 'المنتج غير صحيح.',
        ],
        'filtering' => [
            'wrong_filtering' => 'خطاء في الفلطرة.',
        ],
    ],

    // IMPORT INVOICE
    'import_invoices_validation' => [
        'import_invoice_id' => [
            'required'  => 'يجب اختيار الفاتورة.',
            'exists'  => 'يجب اختيار الفاتورة.',
        ],
        'products' => [
            'required'  => 'يجب اختيار المنتجات.',
        ],
        // INVOICE INFO
        'name' => [
            'required'  => 'يجب ادخال اسم الفاتورة.',
            'max'       => 'يجب أن يكون اسم الفاتورة أقل حروفا.',
            'min'       => 'يجب أن يكون اسم الفاتورة أكثر حروفا.',
        ],

        'supplier_id' => [
            'required'  => 'يجب اختيار المورد.',
            'exists'    => 'المورد الذي تم اختيارة غير صحصح.',
        ],

        'date' => [
            'required'  => 'يجب ادخال تاريخ الفاتورة.',
            'date'      => 'لم يتم ادخال تاريخ الفاتورة.',
        ],

        'number' => [
            'required' => 'يجب ادخال رقم الفاتورة.',
            'unique'   => 'رقم الفاتورة موجود بالفعل.',
            'numeric'  => 'رقم الفاتورة غير صحيح.',
        ],

        'tax' => [
            'required'  => 'يجب اختيار الضريبة.',
            'boolean'      => 'لم يتم اختيار الضريبة.',
        ],

        // PRODUCT CREDIT
        'products_credit' => ['required' => 'يجب ادخال بينات المنتجات.'],
        'product_id' => [
            'required'  => 'يجب اختيار المنتج.',
            'exists'    => 'المنتج الذي تم اختيارة غير صحصح.',
        ],

        'quantity' => [
            'required'  => 'يجب ادخال الكمية لكل المنتجات.',
            'numeric'   => 'الكمية يجب ان تكون رقم صحيح فقط.',
            'min'   => 'يجب ادخال الكمية لكل المنتجات.',
            'max'   => 'الكمية غير صحيحة.',
        ],

        'package_size' => [
            'required'  => 'يجب ادخال حجم العبوة لكل المنتجات.',
            'numeric'   => 'حجم العبوة يجب ان تكون ارقام فقط.',
        ],

        'purchase_price' => [
            'required'  => 'يجب ادخال سعر الشراء لكل المنتجات.',
            'numeric'   => 'سعر الشراء يجب ان تكون ارقام فقط.',
        ],

        'discount' => [
            'numeric'   => 'الخصم يجب ان يكون رقم.',
            'max'       => 'الخصم غير صحصح.',
            'min'       => 'الخصم اقل من صفر.',
        ],

        'warehouse_id' => [
            'required'  => 'يجب اختيار المخازن.',
            'exists'    => 'المخزن الذي تم اختيارة غير صحصح.',
        ],
    ],

    // SUPPLIER INITIATORY CREDIT
    'supplier_initiatory_credit' => [
        'supplier_id' => [
            'required' => 'يجب اختيار المورد.',
            'exists' => 'اختيار المورد غير صحيح.',
        ],
        'amount' => [
            'required'  => 'يجب ادخال المبلغ.',
            'numeric'   => 'المبلغ غير صحيح.',
        ],
        'date' => [
            'required'  => 'يجب اختيار التاريخ.',
            'date'      => 'التاريخ غير صحيح.',
        ],
    ],

    // CUSTOMER BRANCH INITIATORY CREDIT
    'customer_branch_initiatory_credit' => [
        'customer_branch_id' => [
            'required' => 'يجب اختيار العميل و الفرع.',
            'exists' => 'اختيار العميل غير صحيح.',
        ],
        'amount' => [
            'required'  => 'يجب ادخال المبلغ.',
            'numeric'   => 'المبلغ غير صحيح.',
        ],
        'date' => [
            'required'  => 'يجب اختيار التاريخ.',
            'date'      => 'التاريخ غير صحيح.',
        ],
    ],

    // CUSTOMERS
    'customers_validation' => [
        'name'  => [
            'required' => 'يجب ادخال اسم العميل.',
            'unique' => 'العميل مسجل بالفعل.',
            'min' => 'اسم العميل غير صحيح.',
            'max' => 'اسم العميل غير صحيح',
        ],
        'branches'  => [
            'address' => [
                'required' => 'يجب ادخال عنوان الفرع.',
                'min' => 'عنوان الفرع غير صحيح.',
                'max' => 'عنوان الفرع غير صحيح',
            ],
            'discount' => [
                'min' => 'الخصم غير صحيح.',
                'max' => 'الخصم غير صحيح',
            ],
            'contacts' => [
                // CONTACTS
                'name' => [
                    'required'  => 'يجب ادخال اسم العامل في الفرع.',
                    'min'       => 'اسم العامل في الفرع يجب ان يكون حروف اكثر.',
                    'max'       => 'اسم العامل في الفرع يجب ان يكون حروف اقل.',
                ],
                'phone_number' => [
                    'required' => 'يجب ادخال رقم العامل في الفرع.',
                    'min'       => 'رقم العامل في الفرع يجب ان يكون ارقام اكثر.',
                    'max'       => 'رقم العامل في الفرع يجب ان يكون ارقام اقل.',
                ],
                'position_id' => [
                    'required' => 'يجب اختيار الوظيفة.',
                    'exists' => 'اختيار الوظيفة غير صحيح.',
                ],
            ],
        ],
        // PAYMENTS
        'payments' => [
            'date' => [
                'required' => 'يجب اختيار التاريخ.',
                'date' => 'التاريخ غير صحيح.',
            ],
            'customer' => [
                'required' => 'يجب اختيار العميل.',
                'exists' => 'العميل غير صحيح.',
            ],
            'money_courier' => [
                'required' => 'يجب اختيار المشخص.',
                'exists' => 'الشخص الذي تم اختياره غير صحيح.',
            ],
            'customer_branch_contact_id' => [
                'required' => 'يجب اختيار اسم الشخص.',
                'exists' => 'اسم الشخص غير صحيح.',
            ],
            'amount' => [
                'required' => 'يجب ادخال القيمة.',
                'numeric'  => 'يجب ادخال رقم.',
                'max'      => 'الرقم المدفوع غير صحيص!',
                'min'      => 'الرقم المدفوع غير صحيص!',
            ],
            'payment_types' => [
                'required' => 'يجب اختيار طريقة الدفع.',
                'exists' => 'طريقة الدفع غير صحيح.',
            ],
        ]
    ],

    // EXPORT INVOICES
    'export_invoices_validation' => [
        // INVOICE INFO
        'name' => [
            'required'  => 'يجب ادخال اسم الفاتورة.',
            'max'       => 'يجب أن يكون اسم الفاتورة أقل حروفا.',
            'min'       => 'يجب أن يكون اسم الفاتورة أكثر حروفا.',
        ],

        'number' => [
            'required' => 'يجب ادخال رقم الفاتورة.',
            'unique'   => 'رقم الفاتورة موجود بالفعل.',
            'numeric'  => 'رقم الفاتورة غير صحيح.',
        ],

        'customer_branch_id' => [
            'required'  => 'يجب اختيار فرع العميل.',
            'exists'    => 'فرع العميل الذي تم اختيارة غير صحصح.',
        ],

        'seller_id' => [
            'required'  => 'يجب اختيار البائع.',
            'exists'    => 'اختيار البائعين غير صحيح.',
        ],

        'tax' => [
            'required'  => 'يجب اختيار الضريبة.',
            'boolean'      => 'لم يتم اختيار الضريبة.',
        ],

        'discount' => [
            'numeric'   => 'الخصم يجب ان يكون رقم.',
            'max'       => 'الخصم غير صحصح.',
            'min'       => 'الخصم اقل من صفر.',
        ],

        'date' => [
            'required'  => 'يجب ادخال تاريخ الفاتورة.',
            'date'      => 'لم يتم ادخال تاريخ الفاتورة.',
        ],

        // SOLD PRODUCTS
        'sold_products' => ['required' => 'يجب ادخال بينات المنتجات.'],

        'product_id' => [
            'required'  => 'يجب اختيار المنتج.',
            'exists'    => 'المنتج الذي تم اختيارة غير صحصح.',
        ],

        'quantity' => [
            'required'  => 'يجب ادخال الكمية لكل المنتجات.',
            'numeric'   => 'الكمية يجب ان تكون رقم صحيح فقط.',
            'min'   => 'يجب ادخال الكمية لكل المنتجات.',
            'max'   => 'الكمية المتاحة من الصنف هي: ',
        ],

        'sold_price' => [
            'required'  => 'يجب ادخال سعر البيع لكل المنتجات.',
            'numeric'   => 'سعر البيع يجب ان تكون ارقام فقط.',
            'min'       => 'سعر البيع اقل من سعر الشراء.',
        ],
    ],


    // REFUNDS
    'refunds_validation' => [
        'refund_id' => [
            'required' => 'يجب اختيار امر المرتجع.',
            'exists' => 'امر المرتجع غير صحيح.',
            'approved' => 'امر الارتجاع مرحل ولا يمكن تعديلة!',
        ],
        // REFUND ORDER INFO
        'title' => [
            'required'  => 'يجب ادخال عنوان او سبب الارتجاع.',
            'max'       => 'يجب أن يكون العنوان أقل حروفا.',
            'min'       => 'يجب أن يكون العنوان أكثر حروفا.',
        ],
        'number' => [
            'required' => 'يجب ادخال رقم اذن المرتجعات.',
            'unique' => 'رقم اذن المرتجعات موجود بالفعل.',
        ],
        'model_id' => [
            'required' => 'يجب اختيار الفرع.',
        ],
        'date' => [
            'required'  => 'يجب ادخال التاريخ.',
            'date'       => 'التاريخ غير صحيح.',
        ],
        'type' => [
            'required'  => 'يجب اختيار نوع الارتجاع.',
            'in'       => 'يجب اختيار نوع الارتجاع.',
        ],
        'products' => [
            'required' => 'يجب اختيار المنتجات للارتجاع.',
            'product_id' => [
                'required' => 'يجب اختيار المنتج.',
                'exists' => 'المنتج غير صحيحة.',
            ],
            'quantity' => [
                'required' => 'يجب ادخال كمية الارتجاع.',
                'min' => 'كمية المرتجع غير صحيحة.',
                'max' => 'كمية المرتجع كبيرة وغير صحيحة.',
            ],
            'price' => [
                'required' => 'يجب ادخال سعر الصنف.',
            ]
        ],
    ],


    // PRODUCT DISMISS ORDER
    'product_dismiss_order_validation' => [
        'title' => [
            'required' => 'يجب ادخال عنوان امر صرف المنتجات.',
            'min' => 'العنوان يجب ان يكون اكثر حروفا.',
            'max' => 'العنوان يجب ان يكون اكثر حروفا.',
        ],
        'products' => [
            'required' => 'يجب اختيار المنتجات.',
            'product_id' => [
                'required' => 'يجب اختيار المنتج.',
                'exists' => 'المنتج غير صحيح.',
            ],
            'quantity' => [
                'required' => 'يجب ادخال الكمية.',
                'numeric' => 'الكمية غير صحيحة.',
                'min' => 'الكمية غير صحيحة.',
                'max' => 'الكمية غير صحيحة.',
            ],
            'reason_id' => [
                'required' => 'يجب اختيار سبب صرف المنتج.',
                'exists' => 'سبب صرف المنتج غير صحيح.',
            ],
        ],
    ],

    // REPORTS
    'reports' => [
        'products' => [
            'history' => [
                'date' => 'يجب اختيار التاريخ.',
                'product_id' => 'يجب اختيار الصنف.',
            ]
        ],
        'sales' => [
            'customer_branch_products_withdrawals' => [
                'date' => 'يجب اختيار التاريخ.',
                'customer_branch_id' => 'يجب اختيار العميل و الفرع.',
            ],
        ],
    ],
];